tutorials/RisingTaylorBubble/RisingTaylorBubbleRun29-hexahedral/0.org/indicator
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     9.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      indicator;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        //type            zeroGradient;
        type            fixedValue;
        value           uniform 1;
    }

    outlet
    {
        //type            zeroGradient;
        type            fixedValue;
        value           uniform 1;
    }

    walls
    {
        //type            zeroGradient;
        type            fixedValue;
        value           uniform 1;
    }
}

// ************************************************************************* //
